my_number = 10       # 1) შექმენი ცვლადი my_number და მიაწერე რიცხვი 10. დაბეჭდე ცვლადის მნიშვნელობა.
print(my_number)



my_text = "hello world"  #2)შექმენი ცვლადი my_text და მიაწერე მას ტექსტი "Hello, World!". დაბეჭდე ცვლადის ტიპი.
print(my_text)



num1 = 5                 #3)შექმენი ორი ცვლადი num1 და num2, და მიაწერე მათ 5 და 15. დაბეჭდე მათ ჯამი.
num2 = 15
print(num1 + num2)



first_name =  "sopia"    #4)შექმენი ორი ცვლადი first_name და last_name და მიაწერე მათ შესაბამისი სახელები. დაბეჭდე ორივე ერთად.
last_name =  " gorgadze"
print(first_name  +  last_name)



age = 9              #5)შექმენი ცვლადი age და მიაწერე მას 8. შემდეგ შეცვალე მისი მნიშვნელობა 9-ზე და დაბეჭდე ახალი მნიშვნელობა.
age = 8
print(age)



str_num = "10"        #6) შექმენი ცვლადი, str_num და შეინახეთ “10”, მოცემული ცვლადი გადაიყვანეთ ინტეჯერში და შემდეგ გაამრავლეთ ექვსზე
print(int(str_num) * 6)



num1 = "10"           #7) შექმენი ცვლადები num1 და num2, ამ ცვლადებში შეინახეთ: “10” და “5”, შემდეგ გადაიყვანეთ ინტეჯერებში და გადაამრავლეთ
num2 = "5"
print(int(num1) * int(num2))



num1 = 10               #8) შექმენით რამოდენიმე ცვლადი მინიმუმ 5 რომლებშიც შეინახავთ რიცხვებს შემდეგ კი დაბეჭდეთ მათი საშუალო არითმეტიკული.
num2 = 20
num3 = 30
num4 = 40
num5 = 50
num6 = 60
num7 = 70
num8 = 80
num9 = 90

print((num1 + num2 + num3 + num4 + num5 + num6 + num7 + num8 + num9) / 9)